# Project 1, Part 1, Executive Questions: Sales Specific Questions

University of California, Berkeley
Master of Information and Data Science (MIDS) program
w205 - Fundamentals of Data Engineering

Student: Landon Morin

Year: 2023 anticipated

Semester: Spring

Section:

# Included Modules and Packages

Code cell containing your includes for modules and packages

In [18]:
import math
import numpy as np
import pandas as pd

import psycopg2

# Supporting code

Code cells containing any supporting code, such as connecting to the database, any functions, etc.  Remember you can use any code from the labs.

In [19]:
#
# function to run a select query and return rows in a pandas dataframe
# pandas puts all numeric values from postgres to float
# if it will fit in an integer, change it to integer
#

def my_select_query_pandas(query, rollback_before_flag, rollback_after_flag):
    "function to run a select query and return rows in a pandas dataframe"
    
    if rollback_before_flag:
        connection.rollback()
    
    df = pd.read_sql_query(query, connection)
    
    if rollback_after_flag:
        connection.rollback()
    
    # fix the float columns that really should be integers
    
    for column in df:
    
        if df[column].dtype == "float64":

            fraction_flag = False

            for value in df[column].values:
                
                if not np.isnan(value):
                    if value - math.floor(value) != 0:
                        fraction_flag = True

            if not fraction_flag:
                df[column] = df[column].astype('Int64')
    
    return(df)

In [20]:
connection = psycopg2.connect(
    user = "postgres",
    password = "ucb",
    host = "postgres",
    port = "5432",
    database = "postgres"
)

In [21]:
cursor = connection.cursor()

# Instructions for Specific Questions

For each specific quesion, you must write 1 and only 1 query that answers that specific question.  The results of your query must be displayed in a Pandas dataframe as demonstrated in the labs

All output should be sorted.

For store name, use the city name the store is located in.

When sorting by store name, sort in alphabetical order.

For month, use the full month name: January, February, March, etc.

When sorting by month, sort in calendar order: January, February, March, etc.  You may find it useful to include a month number to help with the sort.  It's ok to leave it in the output.

For day of week, use the full day of week name: Sunday, Monday, Tuesday, etc.

When sorting by day of week, sort in day of week order: Sunday, Monday, Tuesday, etc. You may find it usefule to include a day of week number to help with the sort.  It's ok to leave it in the output.

# 1.1.1 Total Sales as a Dollar Amount for all of AGM

In [22]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select sum(total_amount) as total_sales  
from sales

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   total_sales
0     98739408

# 1.1.2 Total Sales as a Dollar Amount by Store

Sort by store name in alphabetical order

In [23]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       sum(total_amount) as total_sales
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store
order by store


"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

       store  total_sales
0   Berkeley     25041060
1     Dallas     19408260
2      Miami     17692404
3  Nashville     14573172
4    Seattle     22024512

# 1.1.3 Total Sales as a Dollar Amount by Month

Sort by month full name in calendar order

In [24]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select to_char(date_trunc('month', sale_date), 'Month') as month, 
       sum(total_amount) as monthly_sum 
from sales
group by date_trunc('month', sale_date), month
order by date_trunc('month', sale_date)



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

        month  monthly_sum
0   January        7803828
1   February       7574280
2   March          8779620
3   April          8251284
4   May            7977840
5   June           8124108
6   July           7993044
7   August         9029808
8   September      7578960
9   October        8895108
10  November       8391108
11  December       8340420

# 1.1.4 Total Sales as a Dollar Amount by Store and Month

Sort by store name in alphabetical order, then by month full name in calendar order

In [35]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       to_char(date_trunc('month', sale_date), 'Month') as month, 
       sum(total_amount) as monthly_sum
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store, date_trunc('month', sale_date), month
order by store, date_trunc('month', sale_date)



"""

df = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df

        store      month  monthly_sum
0    Berkeley  January        1988904
1    Berkeley  February       1930272
2    Berkeley  March          2224500
3    Berkeley  April          2092056
4    Berkeley  May            2019264
5    Berkeley  June           2065140
6    Berkeley  July           2034708
7    Berkeley  August         2286732
8    Berkeley  September      1922256
9    Berkeley  October        2248008
10   Berkeley  November       2127384
11   Berkeley  December       2101836
12     Dallas  January        1532232
13     Dallas  February       1487076
14     Dallas  March          1729404
15     Dallas  April          1626900
16     Dallas  May            1567404
17     Dallas  June           1596660
18     Dallas  July           1569072
19     Dallas  August         1772712
20     Dallas  September      1489092
21     Dallas  October        1754220
22     Dallas  November       1646436
23     Dallas  December       1637052
24      Miami  January        1391916
25      Miami  February       1352136
26      Miami  March          1579920
27      Miami  April          1482600
28      Miami  May            1430916
29      Miami  June           1455804
30      Miami  July           1431048
31      Miami  August         1632324
32      Miami  September      1352496
33      Miami  October        1590708
34      Miami  November       1494468
35      Miami  December       1498068
36  Nashville  January        1147716
37  Nashville  February       1114788
38  Nashville  March          1292100
39  Nashville  April          1213176
40  Nashville  May            1183092
41  Nashville  June           1215228
42  Nashville  July           1177284
43  Nashville  August         1320444
44  Nashville  September      1116972
45  Nashville  October        1317600
46  Nashville  November       1247364
47  Nashville  December       1227408
48    Seattle  January        1743060
49    Seattle  February       1690008
50    Seattle  March          1953696
51    Seattle  April          1836552
52    Seattle  May            1777164
53    Seattle  June           1791276
54    Seattle  July           1780932
55    Seattle  August         2017596
56    Seattle  September      1698144
57    Seattle  October        1984572
58    Seattle  November       1875456
59    Seattle  December       1876056

# 1.1.5 Total Sales as a Dollar Amount by Day of Week

Sort by day of week in day of week order.

In [26]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select to_char(date_trunc('day', sale_date), 'Day') as day_of_week, 
       sum(total_amount) as monthly_sum 
from sales
group by day_of_week, extract(dow from sale_date)
order by extract(dow from sale_date)



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

  day_of_week  monthly_sum
0   Sunday        18589068
1   Monday        13167720
2   Tuesday        6895332
3   Wednesday     13952556
4   Thursday      13834644
5   Friday        12878628
6   Saturday      19421460

# 1.1.6 Total Sales as a Dollar Amount by Store and Day of Week

Sort by store name in alphabetical order, then by day of week in day of week order.

In [27]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       to_char(date_trunc('day', sale_date), 'Day') as day_of_week, 
       sum(total_amount) as monthly_sum
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store, day_of_week, extract(dow from sale_date)
order by store, extract(dow from sale_date)



"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

        store day_of_week  monthly_sum
0    Berkeley   Sunday         4694640
1    Berkeley   Monday         3340116
2    Berkeley   Tuesday        1752036
3    Berkeley   Wednesday      3546144
4    Berkeley   Thursday       3507660
5    Berkeley   Friday         3273240
6    Berkeley   Saturday       4927224
7      Dallas   Sunday         3650748
8      Dallas   Monday         2602980
9      Dallas   Tuesday        1352760
10     Dallas   Wednesday      2749956
11     Dallas   Thursday       2722356
12     Dallas   Friday         2517408
13     Dallas   Saturday       3812052
14      Miami   Sunday         3331680
15      Miami   Monday         2364624
16      Miami   Tuesday        1232220
17      Miami   Wednesday      2484180
18      Miami   Thursday       2478768
19      Miami   Friday         2321196
20      Miami   Saturday       3479736
21  Nashville   Sunday         2743644
22  Nashville   Monday         1946532
23  Nashville   Tuesday        1015344
24  Nashville   Wednesday      2061324
25  Nashville   Thursday       2031072
26  Nashville   Friday         1909512
27  Nashville   Saturday       2865744
28    Seattle   Sunday         4168356
29    Seattle   Monday         2913468
30    Seattle   Tuesday        1542972
31    Seattle   Wednesday      3110952
32    Seattle   Thursday       3094788
33    Seattle   Friday         2857272
34    Seattle   Saturday       4336704

# 1.1.7 Total Number of Sales for all of AGM

In [29]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select count(distinct(sale_id, store_id)) as total_sales  
from sales


"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   total_sales
0      1537617

# 1.1.8 Total Number of Sales by Store

Sort by store name in alphabetical order

In [31]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       count(distinct(sa.sale_id, sa.store_id)) as total_sales 
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store
order by store

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

       store  total_sales
0   Berkeley       390375
1     Dallas       302120
2      Miami       275074
3  Nashville       227721
4    Seattle       342327

# 1.1.9 Average Dollar Amount per Sale

In [32]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select avg(total_amount) as avg_revenue
from sales

"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

   avg_revenue
0    64.215866

# 1.1.10 Average Dollar Amount per Sale by Store

Sort by store name in alphabetical order

In [33]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select s.city as store,
       avg(total_amount) as avg_sale
from stores as s 
     join sales as sa 
         on s.store_id = sa.store_id
group by store
order by store


"""

my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)

       store   avg_sale
0   Berkeley  64.146167
1     Dallas  64.240236
2      Miami  64.318707
3  Nashville  63.995732
4    Seattle  64.337642

# 1.1.11 The Executives have also asked you to provide your best example of a data visualization for one of the above queries

You may choose any one of the above queries. 

It's best to select the one that you think will provide the most interesting data visualization.  

You are allowed to add a pivot as demonstrated in the labs if it is needed for your data visualization.

In [36]:
# Data to plot
labels = df[]
sizes = [504, 337, 415, 280]
labels_gender = ['Man','Woman','Man','Woman','Man','Woman','Man','Woman']
sizes_gender = [315,189,125,212,270,145,190,90]
colors = ['#ff6666', '#ffcc99', '#99ff99', '#66b3ff']
colors_gender = ['#c2c2f0','#ffb3e6', '#c2c2f0','#ffb3e6', '#c2c2f0','#ffb3e6', '#c2c2f0','#ffb3e6']
explode = (0.2,0.2,0.2,0.2) 
explode_gender = (0.1,0.1,0.1,0.1,0.1,0.1,0.1,0.1)
#Plot
plt.pie(sizes, labels=labels, colors=colors, startangle=90,frame=True, explode=explode,radius=3)
plt.pie(sizes_gender,colors=colors_gender,startangle=90, explode=explode_gender,radius=2 )
#Draw circle
centre_circle = plt.Circle((0,0),1.5,color='black', fc='white',linewidth=0)
fig = plt.gcf()
fig.gca().add_artist(centre_circle)
 
plt.axis('equal')
plt.tight_layout()
plt.show()

TypeError: '<' not supported between instances of 'str' and 'int'